[
    {
        "name": "White Wizard",
        "desc": "This job/class is meant to emulate what you might expect a White Mage to be in other Final Fantasy games. Consider Porom or Rosa to be the basis.",
        "materia": [
            "Restore",
            "Heal",
            "Revive",
            "Transform",
            "Mystify",
            "Time",
            "Barrier",
            "Exit",
            "Shield",
            "Sense",
            "W-Magic",
            "MP Plus",
            "Magic Plus",
            "All",
            "Full Cure"
        ]
    },
    {
        "name": "Pyromaniac",
        "desc": "Discovering an affinity to fire, and heat, at a young age, the Pyromaniac has spent a lifetime specializing in the manipulation of flame. Be it casting simple fire spells, or summoning powerful fire-based monsters this job is ready to dish out damage. A feat that can be boosted even further with certain support Materia. Finally, if it all looks like it's going to hell a last ditch effort summon of the beast Phoenix might be all you need to get back on your feet.",
        "materia": [
            "Fire",
            "Ifrit",
            "Phoenix",
            "All",
            "Elemental",
            "Magic Counter",
            "Magic Plus",
            "MP Plus",
            "Final Attack",
            "MP Turbo",
            "Quadra Magic",
            "Mega All"
        ]
    },
    {
        "name": "Cryotechnic",
        "desc": "Imagine growing up being absolutely comfortable with the icy chill of cold temperatures. If you can relate to that, you might just be a Cryotechnic. These ice-based mages primarily focus on hitting things hard with icy blasts, along with occasionally relying on the ice goddess Shiva for extra assistance. An affinity for manipulating water has also granted this class the ability to harness curative magic, via manipulations of the waters of life.",
        "materia": [
            "Ice",
            "MP Plus",
            "Magic Plus",
            "Shiva",
            "All",
            "Elemental",
            "MP Turbo",
            "Quadra Magic",
            "Magic Counter",
            "Mega All",
            "Restore"
        ]
    },
    {
        "name": "Rogue",
        "desc": "the idea is something similar to what you might expect a WoW Rogue to be, with a loose base off of Locke from FF6.",
        "materia": [
            "Poison",
            "Exit",
            "Steal",
            "Counter",
            "Speed Plus",
            "Luck Plus",
            "Gil Plus",
            "Added Effect",
            "Steal As Well",
            "Sneak Attack"
        ]
    },
    {
        "name": "Engineer",
        "desc": "The lightning-based counter to Pyro and Cryo, the Engineer is focused on delivering upon the people powerful lightning blasts. The class is also capable of summoning the powerful elder god Ramuh for additional electrical damage. Finally the ability to shock new life into people like a defribulator has allowed the use of Revive Materia. Knowledge of the mechanical side of items has granted them the ability to use items twice in a single round.",
        "materia": [
            "Lightning",
            "Revive",
            "MP Plus",
            "Magic Plus",
            "Ramuh",
            "All",
            "Elemental",
            "Quadra Magic",
            "MP Turbo",
            "Magic Counter",
            "Mega All",
            "W-Item"
        ]
    },
    {
        "name": "Blue Mage",
        "desc": "A character class which primarily focuses on the learning of enemy attacks and delivering them upon the enemy in return. Enemy Lure is available for sanity purposes when attempting to get that one god damn skill.",
        "materia": [
            "Enemy Skill",
            "MP Plus",
            "Enemy Lure",
            "MP Absorb"
        ]
    },
    {
        "name": "Black Wizard",
        "desc": "The counter to the White Wizard class, which instead specializes in black magic styles.",
        "materia": [
            "Fire",
            "Ice",
            "Lightning",
            "Poison",
            "Earth",
            "Comet",
            "Ultima",
            "MP Plus",
            "Magic Plus",
            "All",
            "W-Magic",
            "Quadra Magic",
            "Magic Counter",
            "MP Turbo"
        ]
    },
    {
        "name": "Summoner",
        "desc": "The Rydia class. This class gets summoning ability, and not a whole lot else. Some summons were left out to ensure this isn't just the \"can use all red\" class, and to provide some uniqueness to classes they're exclusive to.",
        "materia": [
            "Choco/Mog",
            "Ifrit",
            "Shiva",
            "Ramuh",
            "Titan",
            "Odin",
            "Kjata",
            "Bahamut",
            "Alexander",
            "Neo Bahamut",
            "Hades",
            "Bahamut ZERO",
            "Typoon",
            "Magic Plus",
            "MP Plus"
        ]
    },
    {
        "name": "Paladin",
        "desc": "A holy knight. This class has some healing ability, along with primarily battle commands and protection based stuff. This class also is the sole user of KOTR, as it seemed to make sense for a holy knight to be able to summon what is essentially the Knights of the Round Table.",
        "materia": [
            "Restore",
            "Cover",
            "Knights of the Round",
            "HP Plus",
            "Revive",
            "Deathblow",
            "Barrier"
        ]
    },
    {
        "name": "Mime",
        "desc": "...It's a mime? Exp Plus also available to a) provide one reason why you MIGHT want one, and be it makes sense in concept because who's learning quicker than a god damn mime? Likewise the plus materia is allowed under the concept that they're trying to emulate the stats of the person they're copying.",
        "materia": [
            "Mime",
            "Exp Plus",
            "Speed Plus",
            "Magic Plus",
            "Luck Plus",
            "MP Plus",
            "HP Plus"
        ]
    },
    {
        "name": "Magic Knight",
        "desc": "Based off of a suggestion by Fu, this class attempts to emulate the class of the same name from FFV.",
        "materia": [
            "Ice",
            "Lightning",
            "Fire",
            "Poison",
            "Earth",
            "Elemental",
            "Deathblow",
            "Cover",
            "HP Plus"
        ]
    }
]