[
    {
        "name": "White Wizard",
        "desc": "The White Wizard is a master of curative, and beneficial abilities. Restoring HP, reviving the swooned from near death. Determining what weaknesses an enemy may have to alert the others. They also have the ability to harness their very HP totals to increase their MP total.",
        "materia": [
            "Restore",
            "Heal",
            "Revive",
            "Transform",
            "Mystify",
            "Barrier",
            "Shield",
            "Full Cure",
            "MP Turbo",
            "All",
            "Sense",
            "W-Magic",
            "MP Plus",
            "Magic Plus",
            "Mega All",
            "HP <-> MP"
        ]
    },
    {
        "name": "Pyromaniac",
        "desc": "Discovering an affinity to fire, and heat, at a young age, the Pyromaniac has spent a lifetime specializing in the manipulation of flame. Be it casting simple fire spells, or summoning powerful fire-based monsters this job is ready to dish out damage. A feat that can be boosted even further with certain support Materia. Finally, if it all looks like it's going to hell a last ditch effort summon of the beast Phoenix might be all you need to get back on your feet.",
        "materia": [
            "Fire",
            "All",
            "Elemental",
            "Final Attack",
            "Magic Counter",
            "MP Turbo",
            "Quadra Magic",
            "Magic Plus",
            "Mega All",
            "MP Plus",
            "Ifrit",
            "Phoenix"
        ]
    },
    {
        "name": "Cryotechnic",
        "desc": "Imagine growing up being absolutely comfortable with the icy chill of cold temperatures. If you can relate to that, you might just be a Cryotechnic. These ice-based mages primarily focus on hitting things hard with icy blasts, along with occasionally relying on the ice goddess Shiva for extra assistance. An affinity for manipulating water has also granted this class the ability to harness curative magic, via manipulations of the waters of life.",
        "materia": [
            "Ice",
            "Restore",
            "All",
            "Elemental",
            "Magic Counter",
            "MP Turbo",
            "Quadra Magic",
            "Magic Plus",
            "Mega All",
            "MP Plus",
            "Shiva"
        ]
    },
    {
        "name": "Rogue",
        "desc": "It is an unfortunate thing that our world harbors criminals. People who steal from others, and in some cases they even steal their very lives. Stab a victim with a poison coated dagger, steal their things, and then exit before the authorities can arrive. Everything is planned out to a T. The most value for their score. The most experience that can be conned out of the situation. Luck is on their side.",
        "materia": [
            "Exit",
            "Poison",
            "Added Effect",
            "Counter",
            "Sneak Attack",
            "Steal As Well",
            "Steal",
            "Exp Plus",
            "Gil Plus",
            "Luck Plus",
            "Speed Plus"
        ]
    },
    {
        "name": "Engineer",
        "desc": "Every so often a person is born who some say can outright \"speak\" to machinery. They dance with electricity like they themselves are a bolt of lightning. Sometimes they craft the magnificent inventions you see around the planet such as the airship. But sometimes? An engineer just kinda wants to zap the crap out of other people. Be it with normal magical energy or calling in a favor from their Poker buddy Ramuh ... you're in big trouble. But it's not all pain, as they're not above prodding their dead friends with a zappy stick to bring them BACK FROM THE DEAD. Finally a natural affinity for tinkering has gifted them with the natural speed with item use to throw out two in a single moment.",
        "materia": [
            "Lightning",
            "Revive",
            "All",
            "Elemental",
            "Magic Counter",
            "MP Turbo",
            "Quadra Magic",
            "W-Item",
            "Magic Plus",
            "Mega All",
            "MP Plus",
            "Ramuh"
        ]
    },
    {
        "name": "Blue Mage",
        "desc": "A character class which primarily focuses on the learning of enemy attacks and delivering them upon the enemy in return. Enemy Lure is available for sanity purposes when attempting to get that one god damn skill.",
        "materia": [
            "Enemy Skill",
            "MP Plus",
            "Enemy Lure",
            "MP Absorb"
        ]
    },
    {
        "name": "Black Wizard",
        "desc": "The counter to the White Wizard class, which instead specializes in black magic styles.",
        "materia": [
            "Fire",
            "Ice",
            "Lightning",
            "Poison",
            "Earth",
            "Comet",
            "Ultima",
            "MP Plus",
            "Magic Plus",
            "All",
            "W-Magic",
            "Quadra Magic",
            "Magic Counter",
            "MP Turbo"
        ]
    },
    {
        "name": "Summoner",
        "desc": "The Rydia class. This class gets summoning ability, and not a whole lot else. Some summons were left out to ensure this isn't just the \"can use all red\" class, and to provide some uniqueness to classes they're exclusive to.",
        "materia": [
            "Choco/Mog",
            "Ifrit",
            "Shiva",
            "Ramuh",
            "Titan",
            "Odin",
            "Kjata",
            "Bahamut",
            "Alexander",
            "Neo Bahamut",
            "Hades",
            "Bahamut ZERO",
            "Typoon",
            "Magic Plus",
            "MP Plus"
        ]
    },
    {
        "name": "Paladin",
        "desc": "As a child the holy Paladin was showered in religion. Stories of the fabled Knights of the Round Table protecting the innocent caused them to take up arms to protect as well. A devotion to the deity Alexander grants them the power to imbue their strikes with the power of the divine, which also has the added benefit of allowing them to restore, and revive the lame. Legend has it, in moments of absolute crisis their connection to the holy light allows them to summon the legendary Knights they grew up obsessing over to aid them in battle.",
        "materia": [
            "Barrier",
            "Heal",
            "Restore",
            "Revive",
            "Elemental",
            "Cover",
            "HP Plus",
            "Alexander",
            "Knights of the Round"
        ]
    },
    {
        "name": "Mime",
        "desc": "...It's a mime? Exp Plus also available to a) provide one reason why you MIGHT want one, and be it makes sense in concept because who's learning quicker than a god damn mime? Likewise the plus materia is allowed under the concept that they're trying to emulate the stats of the person they're copying.",
        "materia": [
            "Mime",
            "Exp Plus",
            "Speed Plus",
            "Magic Plus",
            "Luck Plus",
            "MP Plus",
            "HP Plus"
        ]
    },
    {
        "name": "Magic Knight",
        "desc": "Based off of a suggestion by Fu, this class attempts to emulate the class of the same name from FFV.",
        "materia": [
            "Ice",
            "Lightning",
            "Fire",
            "Poison",
            "Earth",
            "Elemental",
            "Deathblow",
            "Cover",
            "HP Plus"
        ]
    },
    {
        "name": "Ninja",
        "desc": "Silence incarnate. The sudden stroke of death. The ninja is a master of subversion, and finishing an opponent from the shadows. Incredibly fast, and capable of ending a life in a multitude of ways, the main question with the ninja is how do I want to wreak havoc today? Shall I throw a blade into an opponent's chest perhaps? Put them to sleep with a well timed blow? Use the power of Odin himself to deliver a stab so potent the opponent immediately expires? Or shall the ninja just avoid battle entirely and remain in the shadows waiting to strike?",
        "materia": [
            "Exit",
            "Seal",
            "Added Cut",
            "Added Effect",
            "Sneak Attack",
            "Deathblow",
            "Throw",
            "Enemy Away",
            "Long Range",
            "Pre-Emptive",
            "Speed Plus",
            "Odin"
        ]
    },
    {
        "name": "Dragoon",
        "desc": "In the past the world was plagued by Dragons. To combat this specific talented people were taught a specific brand of warfare which allowed them to take to the skies to battle the Dragons in their own backyard. Through the years they've learned to harness the power of thunder, and leap into the air to deliver upon their foes blows with double or even four times the damage that they'd normally deliver. Strangely, they've also developed a kinship with the Dragon Lord Bahamut, and some say that fabled beast will actually assist the Dragoon when called upon.",
        "materia": [
            "Lightning",
            "Elemental",
            "Double Cut",
            "Counter",
            "Long Range",
            "Luck Plus",
            "HP Plus",
            "Bahamut",
            "Bahamut ZERO",
            "Neo Bahamut"
        ]
    }
]